In [34]:
import numpy as np
import pandas as pd

In [35]:
sr1 = pd.Series([10, -9, 8, 7, 3])

In [36]:
sr1

0    10
1    -9
2     8
3     7
4     3
dtype: int64

In [37]:
type(sr1)

pandas.core.series.Series

In [38]:
sr1.values

array([10, -9,  8,  7,  3], dtype=int64)

In [39]:
sr1.value_counts()

 7     1
 3     1
 10    1
 8     1
-9     1
dtype: int64

In [40]:
sr1.dtype

dtype('int64')

In [41]:
sr2 = pd.Series([10, -9, 8, 7, 3], index=['a','b','c','d','e'])

In [42]:
sr2

a    10
b    -9
c     8
d     7
e     3
dtype: int64

In [43]:
sd = {'sunyoung':1000000000, 'psy':99999999, 'sunny':888888888, 'jungjae':100000000}

In [44]:
type(sd)

dict

In [45]:
sr3 = pd.Series(sd)

In [46]:
sr3

jungjae      100000000
psy           99999999
sunny        888888888
sunyoung    1000000000
dtype: int64

In [47]:
type(sr3)

pandas.core.series.Series

In [48]:
sr3.name='월급'

In [49]:
sr3.index.name = '이름'

In [50]:
sr3

이름
jungjae      100000000
psy           99999999
sunny        888888888
sunyoung    1000000000
Name: 월급, dtype: int64

In [51]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
        "year": [2016, 2017, 2018, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

In [52]:
df = pd.DataFrame(data)

In [53]:
df

      names  points  year
0  sunyoung     1.5  2016
1  sunyoung     1.7  2017
2  sunyoung     3.6  2018
3   jungjae     2.4  2015
4   jungjae     2.9  2016

In [54]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [55]:
df.columns

Index(['names', 'points', 'year'], dtype='object')

In [56]:
df.values

array([['sunyoung', 1.5, 2016],
       ['sunyoung', 1.7, 2017],
       ['sunyoung', 3.6, 2018],
       ['jungjae', 2.4, 2015],
       ['jungjae', 2.9, 2016]], dtype=object)

In [57]:
df2 = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])

In [58]:
df2

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [59]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [60]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [61]:
df2.values

array([[2016, 'sunyoung', 1.5, nan],
       [2017, 'sunyoung', 1.7, nan],
       [2018, 'sunyoung', 3.6, nan],
       [2015, 'jungjae', 2.4, nan],
       [2016, 'jungjae', 2.9, nan]], dtype=object)

In [62]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2016.400000  2.420000
std       1.140175  0.864292
min    2015.000000  1.500000
25%    2016.000000  1.700000
50%    2016.000000  2.400000
75%    2017.000000  2.900000
max    2018.000000  3.600000

In [63]:
df2

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [64]:
#df2.describe?

In [65]:
df2.describe(include=[np.object])

           names  penalty
count          5      0.0
unique         2      0.0
top     sunyoung      NaN
freq           3      NaN